app/views/usuarios/show.html.erb

    <tbody>
    <% @usuario.reclamacaos.each do |reclamacao| %>
---
SELECT "reclamacaos".* FROM "reclamacaos" WHERE "reclamacaos"."usuario_id" = ?  [["usuario_id", 1]]