app/controllers/login_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def login(email, senha)
    usuario = Usuario.all
    user = nil
    usuario.each do |u|