app/controllers/reclamacaos_controller.rb

SELECT "reclamacaos".* FROM "reclamacaos" WHERE (titulo like '%%') AND "reclamacaos"."nome_empresa" = ?  [["nome_empresa", "Empresa1"]]
SELECT "reclamacaos".* FROM "reclamacaos"
---
  def index
    if params[:title] and params[:empresa]
      @reclamacaos = Reclamacao.where("titulo like ?","%#{params[:title]}%").where(:nome_empresa => params[:empresa])
    else
      @reclamacaos = Reclamacao.all

INSERT INTO "reclamacaos" ("titulo", "texto", "cat_problema", "nome_empresa", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reclamacao = Reclamacao.new(reclamacao_params)
    user = Usuario.get_usuario_logado
    @reclamacao.write_attribute(:usuario_id, user.id)
    respond_to do |format|
      if @reclamacao.save

UPDATE "reclamacaos" SET "nome_empresa" = ?, "updated_at" = ? WHERE "reclamacaos"."id" = ?  [["nome_empresa", "Empresa2"], ["updated_at", "2021-03-16 20:23:04.964550"], ["id", 1]]
---
  def update
    user = Usuario.get_usuario_logado
    @reclamacao.write_attribute(usuario_id, user.id)
    respond_to do |format|
      if @reclamacao.update(reclamacao_params)

DELETE FROM "reclamacaos" WHERE "reclamacaos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @reclamacao.destroy

SELECT "reclamacaos".* FROM "reclamacaos" WHERE "reclamacaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_reclamacao
      @reclamacao = Reclamacao.find(params[:id])