app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("login", "email", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["login", "laisy"], ["email", "laisyferreira@gmail.com"], ["senha", "123456"], ["created_at", "2021-01-07 22:51:19.295460"], ["updated_at", "2021-01-07 22:51:19.295460"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 980190962]]
---
  def destroy
    @usuario.destroy